IDEA Open Model
RebarStirrupPattern Class
Compatible with IDEA StatiCa 20.1
 Represents a pattern of rebar
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Model.RebarPatternBase
 IdeaRS.OpenModel.Model.RebarStirrupPattern
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public class RebarStirrupPattern : RebarPatternBase
Public Class RebarStirrupPattern
	Inherits RebarPatternBase
The RebarStirrupPattern type exposes the following members.
Constructors
Name | Description
RebarStirrupPattern
 create a new instance.
Top
Properties
Name | Description
AddFirstStirrup
 true: add first stirrup for this pattern. used do exclude the first stirrup in patterns > first.
Distance
 Gets or sets the distance between rebars for this pattern.
EndPosition
 This defines end position of the pattern. It is the distance from the start point of the group. Its value should be in corelation to PositionMode
 (Inherited from RebarPatternBase.)
Id
 Element Id
 (Inherited from OpenElementId.)
Relative
 Mode of defining the position of the pattern false is for absolute length (position) of the pattern (default) true is for relative length (position) of the pattern in range [0 1]
 (Inherited from RebarPatternBase.)
StartPosition
 This defines begin position of the pattern. It is the distance from the start point of the group. Its value should be in corelation to PositionMode
 (Inherited from RebarPatternBase.)
Translation
 Gets or sets the local eccentricity in X and Y direction apply transfotmation at 3D (section 3D) then transform to 3D.
Top
See Also
Reference
IdeaRS.OpenModel.Model Namespace